; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	spectrograph4 - mode
	infrared2 - mode
	infrared5 - mode
	image1 - mode
	thermograph3 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	Star0 - direction
	Star1 - direction
	Star11 - direction
	Star6 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Star13 thermograph0)
	(have_image Star13 infrared5)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 infrared2)
	(have_image Phenomenon15 infrared5)
	(have_image Star16 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 6
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon15 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon15 instrument1 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 1 of 6
6. (take_image satellite1 phenomenon15 instrument1 infrared5)
   added: (have_image phenomenon15 infrared5)
   goals met: 2 of 6
7. (turn_to satellite1 star13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star13)
   goals met: 2 of 6
8. (take_image satellite1 star13 instrument1 infrared5)
   added: (have_image star13 infrared5)
   goals met: 3 of 6
9. (take_image satellite1 star13 instrument1 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 4 of 6
10. (turn_to satellite1 star16 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star16)
   goals met: 4 of 6
11. (take_image satellite1 star16 instrument1 infrared2)
   added: (have_image star16 infrared2)
   goals met: 5 of 6
12. (turn_to satellite0 phenomenon14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 6
13. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 5 of 6
14. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 6
16. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 6 of 6
